Revit 2026 API

# ExternalServiceNumberOfServers Property

---

Indicates the number of servers currently registered with the service.

**Namespace:** Autodesk.Revit.DB.ExternalService**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int NumberOfServers { get; }
```
```vb
Public ReadOnly Property NumberOfServers As Integer
	Get
```
```cpp
public:
property int NumberOfServers {
	int get ();
}
```
```fsharp
member NumberOfServers : int with get
```

#### Property Value

Int32

This is the muber of all registered servers, not just of the ones that are currently active.

#### Reference

ExternalService Class

Autodesk.Revit.DB.ExternalService Namespace